<a href="https://colab.research.google.com/github/DepartmentOfStatisticsPUE/air-2020/blob/master/notebooks/3_pandas_podsumowanie.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1. Wczytanie modułów pandas i numpy

In [0]:
import numpy as np
import pandas as pd

2. wczytanie danych z excela

In [0]:
dane=pd.read_excel("gospodarstwa.xlsx")
dane.head()

   klm  woj  trb  zut  d21  d32  ...  d38  d61  d63  los    dochg     wydg
0    1    2   11    5    2    1  ...    2    3    3  1.0  1191.41  1037.29
1    1    2    6    1    2    1  ...    3    4    2  2.0   821.00   887.01
2    1    2    3    1    1    3  ...    3    4    1  4.0  6669.87  6792.13
3    1    2   12    5    2    1  ...    2    4    1  3.0  1872.59  1806.83
4    1    2    1    5    1    3  ...    5    4    2  2.0  1731.44  2795.08

[5 rows x 16 columns]

**Zadanie 2**. Utwórz zbiór, w którym są gospodarstwa ze wsi.

In [0]:
wies=dane.loc[dane.klm == 6] ## wies=dane.loc[dane["klm"] == 6]
wies.shape

(10642, 16)

**Zadanie 3**. Utwórz zbiór, w którym sa gospodarstwa o dochodach > 2000 zł.

In [0]:
zad3=dane.loc[dane.dochg > 2000]
zad3.dochg.describe()

count    13820.000000
mean      3310.709436
std       1810.110084
min       2000.200000
25%       2350.000000
50%       2822.610000
75%       3638.030000
max      50151.970000
Name: dochg, dtype: float64

**Zadanie 5**. Wyswietl informacje o gospodarstwach z województwa dolnoslaskiego
i mazowieckiego z miast powyzej 500 tys. mieszkanców

In [0]:
wyn1=dane.loc[ ( (dane.woj == 2) | (dane.woj == 14) ) & (dane.klm == 1)]

wyn2=dane.loc[ dane.woj.isin([2, 14]) & (dane.klm == 1)]

print(wyn1.shape)

print(wyn2.shape)

(2401, 16)
(2401, 16)

**Zadanie 6**. Losowo wybierz zbiór 30% gospodarstw domowych.

In [0]:
np.random.seed(123)

ncases = dane.shape[0]

sample = round(0.3*ncases)

print(ncases, sample)

rows = np.random.randint(low = 0, high = ncases, size = sample)

dane.iloc[rows]

**Zadanie 7**. Losowo wybierz 100 gospodarstw.

In [0]:
np.random.seed(123)
dane.iloc[ np.random.randint(low=0,high=ncases,size =100) ]

**Zadanie 12**. Wybierz wszystkie kolumny, które zaczynaja sie na litere d.

In [0]:
flag = dane.columns.str.startswith("d")
dane[ dane.columns[flag] ]

**Zadanie 13**. Wybierz wszystkie kolumny, które koncza sie na oj.

In [0]:
flag=dane.columns.str.endswith("oj")
dane[dane.columns[flag]]

**Zadanie 14**. Utwórz nowa zmienna roznica=dochg-wydg. Pozostaw w zbiorze zmienne
dochg, wydg i roznica.

In [0]:
dane["roznica"] = dane.dochg-dane.wydg 

## równoważnie: dane["roznica"]=dane["dochg"]-dane["wydg"]

dane[ ["dochg","wydg","roznica"] ].head()

     dochg     wydg  roznica
0  1191.41  1037.29   154.12
1   821.00   887.01   -66.01
2  6669.87  6792.13  -122.26
3  1872.59  1806.83    65.76
4  1731.44  2795.08 -1063.64

**Zadanie 15**. Utwórz nowe zmienne x=ln(dochg) oraz y=ln(wydg). Pamietaj, ze ln liczymy dla dodatnich wartosci.

In [0]:
dane["x"] = np.log(dane.dochg)
dane["y"] = np.log(dane.wydg)

dane.x.describe()

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: RuntimeWarning: divide by zero encountered in log
  """Entry point for launching an IPython kernel.
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: RuntimeWarning: invalid value encountered in log
  """Entry point for launching an IPython kernel.

count    3.232000e+04
mean             -inf
std               NaN
min              -inf
25%      7.097679e+00
50%      7.501770e+00
75%      7.880372e+00
max      1.082281e+01
Name: x, dtype: float64

**Zadanie 16**. Dokonaj zamiany nazwy zmiennych dochg na dochod oraz wydg na
wydatki.

In [0]:
print(dane.head())

dane=dane.rename(columns={"dochg" : "dochod", "wydg" : "wydatki"})

print(dane.head())

   klm  woj  trb  zut  d21  d32  ...  d61  d63  los    dochg     wydg  roznica
0    1    2   11    5    2    1  ...    3    3  1.0  1191.41  1037.29   154.12
1    1    2    6    1    2    1  ...    4    2  2.0   821.00   887.01   -66.01
2    1    2    3    1    1    3  ...    4    1  4.0  6669.87  6792.13  -122.26
3    1    2   12    5    2    1  ...    4    1  3.0  1872.59  1806.83    65.76
4    1    2    1    5    1    3  ...    4    2  2.0  1731.44  2795.08 -1063.64

[5 rows x 17 columns]
   klm  woj  trb  zut  d21  d32  ...  d61  d63  los   dochod  wydatki  roznica
0    1    2   11    5    2    1  ...    3    3  1.0  1191.41  1037.29   154.12
1    1    2    6    1    2    1  ...    4    2  2.0   821.00   887.01   -66.01
2    1    2    3    1    1    3  ...    4    1  4.0  6669.87  6792.13  -122.26
3    1    2   12    5    2    1  ...    4    1  3.0  1872.59  1806.83    65.76
4    1    2    1    5    1    3  ...    4    2  2.0  1731.44  2795.08 -1063.64

[5 rows x 17 columns]

**Zadanie 17**. Oblicz ile było gospodarstw domowych ze wzgledu na poszczególne
warianty zmiennej klm.

In [0]:
dane.groupby("klm").klm.count()

klm
1     4585
2     3742
3     2965
4     6320
5     4233
6    10642
Name: klm, dtype: int64

In [0]:
## jaki był średni dochód według klm

dane.groupby("klm").dochod.mean()

klm
1    2711.245356
2    2272.834334
3    2097.023748
4    2097.818083
5    2022.226883
6    1893.510959
Name: dochod, dtype: float64

In [0]:
dane.groupby(["klm","d21"]).dochod.mean()

klm  d21
1    1      2736.174755
     2      2708.800944
2    1      2595.940787
     2      2238.843230
3    1      2450.216758
     2      2052.554578
4    1      2299.720729
     2      2046.771906
5    1      2099.462446
     2      1987.676912
6    1      1930.246444
     2      1792.846689
Name: dochod, dtype: float64

In [0]:
dane.groupby("klm")["dochod", "wydatki"].mean()

          dochod      wydatki
klm
1    2711.245356  2529.691418
2    2272.834334  2144.037342
3    2097.023748  1997.231430
4    2097.818083  1989.254513
5    2022.226883  1907.465510
6    1893.510959  1804.656062